#
# Error
#
I18nMessage.errorDriverDeregister=JDBC\u30C9\u30E9\u30A4\u30D0\u30FC{0}\u3092\u767B\u9332\u89E3\u9664\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorDriverLoad=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30BF\u30A4\u30D7{0}\u306B\u306F\u30C9\u30E9\u30A4\u30D0\u30FC\u304C\u30ED\u30FC\u30C9\u3055\u308C\u307E\u305B\u3093\n\u6B21\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u30D5\u30A1\u30A4\u30EB\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093 \n{1}
I18nMessage.errorEmptyJdbcURL=JDBC\u306EURL\u306F\u7A7A\u306B\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorCantLoadDriver={0}\u306EJDBC\u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093
I18nMessage.errorUnsupportedSubProtocol=\u9078\u629E\u3057\u305F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30BF\u30A4\u30D7\u306B\u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30B5\u30D6\u30D7\u30ED\u30C8\u30B3\u30EB\u3067\u3059
I18nMessage.errorInvalidConnection=\u7121\u52B9\u306A\u63A5\u7D9A
I18nMessage.errorDriverNotFound=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30BF\u30A4\u30D7{0}\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
I18nMessage.errorSQL=SQL\u30A8\u30E9\u30FC[{0}] {1}
I18nMessage.errorDriverInstantiation=\u63A5\u7D9A\u306B\u5931\u6557\u3057\u307E\u3057\u305F: \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3067\u304D\u307E\u305B\u3093\u3002{0}
I18nMessage.errorUnauthorizedQuery=\u30AF\u30A8\u30EA\u30FC\u304C\u7121\u52B9\u3067\u3059\u3002\u30AF\u30A8\u30EA\u30FC\u306E\u9078\u629E\u306E\u307F\u8A31\u53EF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
I18nMessage.errorEmptyQuery=SQL\u30AF\u30A8\u30EA\u30FC\u306FNull\u307E\u305F\u306F\u7A7A\u306B\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorNoKeyForDeleteQuery=\u524A\u9664\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u30AD\u30FC\u3068\u3057\u3066\u3001\u30AB\u30E9\u30E0\u3092\u5C11\u306A\u304F\u3068\u30821\u3064\u5B9A\u7FA9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorNoKeyForUpdateQuery=\u66F4\u65B0\u30A2\u30AF\u30B7\u30E7\u30F3\u306E\u30AD\u30FC\u3068\u3057\u3066\u3001\u30AB\u30E9\u30E0\u3092\u5C11\u306A\u304F\u3068\u30821\u3064\u5B9A\u7FA9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorNoFieldForQueryParam=\u53D7\u4FE1\u30EC\u30B3\u30FC\u30C9\u306B\u30D5\u30A3\u30FC\u30EB\u30C9{0}\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u30AF\u30A8\u30EA\u30FC\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u4E00\u90E8\u3067\u3059\u3002
I18nMessage.errorNoUpdatableColumnWasDefined=\u66F4\u65B0\u3059\u308B\u30AB\u30E9\u30E0\u3092\u5C11\u306A\u304F\u3068\u30821\u3064\u5B9A\u7FA9\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorUnsupportedDatabaseAction=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u30A2\u30AF\u30B7\u30E7\u30F3
I18nMessage.errorCantClearPreparedStatement=\u30D7\u30EC\u30D1\u30EC\u30FC\u30B7\u30E7\u30F3\u6E08\u307F\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30AF\u30EA\u30A2\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorCantClosePreparedStatement=\u30D7\u30EC\u30D1\u30EC\u30FC\u30B7\u30E7\u30F3\u6E08\u307F\u306E\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u6B63\u3057\u304F\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorCantCloseJdbcConnectionProperly=JDBC\u63A5\u7D9A\u3092\u6B63\u3057\u304F\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorCantLoadTableSuggestions=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u304B\u3089\u30C6\u30FC\u30D6\u30EB\u540D\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
I18nMessage.errorTaberDoesNotExists=\u30C6\u30FC\u30D6\u30EB{0}\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u624B\u52D5\u3067\u4F5C\u6210\u3059\u308B\u304B\u3001[\u30C6\u30FC\u30D6\u30EB\u304C\u306A\u3044\u5834\u5408\u306F\u4F5C\u6210]\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorRedshiftUnsupportedBytes=\u30D5\u30A3\u30FC\u30EB\u30C9"{0}"\u306E\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u30BF\u30A4\u30D7\u3067\u3059\u3002Redshift\u3067\u306F\u30D0\u30A4\u30C8\u304C\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002AWS\u30E6\u30FC\u30B6\u30FC\u306FS3\u3092\u4F7F\u3063\u3066\u30D0\u30A4\u30CA\u30EA\u30C7\u30FC\u30BF\u3092\u4FDD\u5B58\u3067\u304D\u307E\u3059\u3002
I18nMessage.errorUnsupportedType=\u30D5\u30A3\u30FC\u30EB\u30C9{1}\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044{0}\u30BF\u30A4\u30D7
I18nMessage.errorUnsupportedBooleanType4Oracle=\u30D5\u30A3\u30FC\u30EB\u30C9{0}\u306F\u30D6\u30FC\u30EB\u5024\u3067\u3059\u304C\u3001Oracle\u306F\u30D6\u30FC\u30EB\u5024\u30BF\u30A4\u30D7\u3092\u76F4\u63A5\u7684\u306B\u306F\u30B5\u30DD\u30FC\u30C8\u3057\u3066\u3044\u307E\u305B\u3093\u3002TypeConverter\u30D7\u30ED\u30BB\u30B9\u3092\u4F7F\u3063\u3066\u3053\u306E\u30BF\u30A4\u30D7\u3092\u5909\u63DB\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorVacantAccountKey=\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u306E\u306F\u5171\u6709\u30AD\u30FC\u3092\u4F34\u3046Azure Blob\u63A5\u7D9A\u306E\u307F\u3067\u3059\u3002\u30A2\u30AF\u30BB\u30B9\u540D\u3068\u30A2\u30AF\u30BB\u30B9\u30AD\u30FC\u3092\u5165\u529B\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorSingleSortKeyInvalid=Redshift\u3067\u5358\u4E00\u30AD\u30FC\u3068\u3057\u3066\u5B9A\u7FA9\u3067\u304D\u308B\u30AB\u30E9\u30E0\u306F1\u3064\u306E\u307F\u3067\u3059\u3002
I18nMessage.errorNoRecordReceived=\u51FA\u529B\u3059\u308B\u30EC\u30B3\u30FC\u30C9\u304C\u5C11\u306A\u304F\u3068\u30821\u3064\u5FC5\u8981\u3067\u3059\u3002
I18nMessage.errorPrivateKeyPasswordIncorrect=\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8\u30AD\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u304C\u6B63\u3057\u304F\u3042\u308A\u307E\u305B\u3093\u3002\u3084\u308A\u76F4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorPrivateKeyIncorrect=\u30D7\u30E9\u30A4\u30D9\u30FC\u30C8\u30AD\u30FC\u304C\u6B63\u3057\u304F\u306A\u3044\u304B\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u3084\u308A\u76F4\u3059\u304B\u3001Snowflake\u3067\u751F\u6210\u3057\u305F\u30AD\u30FC\u3092\u4F7F\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
I18nMessage.errorAccessTokenResponse=\u30A2\u30AF\u30BB\u30B9\u30C8\u30FC\u30AF\u30F3\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002\u30A8\u30E9\u30FC\u306E\u8AAC\u660E: {0}
#
# Warning
#
I18nMessage.warnResultSetCantBeClosed=\u30AF\u30A8\u30EA\u30FC\u7D50\u679C\u30BB\u30C3\u30C8\u3092\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
I18nMessage.warnStatementCantBeClosed=\u30AF\u30A8\u30EA\u30FC\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
I18nMessage.warnConnectionCantBeClosed=JDBC\u63A5\u7D9A\u3092\u6B63\u3057\u304F\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
I18nMessage.warnReadOnlyOptimisationFailure=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306E\u6700\u9069\u5316\u3092\u6709\u52B9\u306B\u3059\u308B\u305F\u3081\u306B\u3001\u3053\u306E\u63A5\u7D9A\u3092\u30C9\u30E9\u30A4\u30D0\u30FC\u3078\u306E\u30D2\u30F3\u30C8\u3068\u3057\u3066\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u30E2\u30FC\u30C9\u306B\u542B\u3081\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u3053\u308C\u306F\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
I18nMessage.warnDriverClose=\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9{0}\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u3092\u6B63\u3057\u304F\u9589\u3058\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
#
# Success
#
I18nMessage.successConnection=\u63A5\u7D9A\u306B\u6210\u529F\u3057\u307E\u3057\u305F
# Action on data
I18nMessage.actionOnDataDelete=\u524A\u9664
I18nMessage.actionOnDataInsert=\u633F\u5165
I18nMessage.actionOnDataUpdate=\u66F4\u65B0
I18nMessage.actionOnDataUpsert=UPSERT
I18nMessage.actionOnDataBulkLoad=\u4E00\u62EC\u30ED\u30FC\u30C9
#
I18nMessage.errorCantDiscoverDataset=\u30C6\u30FC\u30D6\u30EB\u30EA\u30B9\u30C8\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093: {0}\u3002
