#
# Error
#
I18nMessage.errorDriverDeregister=Impossible de supprimer l''enregistrement du pilote JDBC {0}.
I18nMessage.errorDriverLoad=Le pilote ne sera pas charg\u00E9 pour le type de base de donn\u00E9es {0}. \nLes fichiers pilotes suivants sont introuvables\u00A0: \n{1}
I18nMessage.errorEmptyJdbcURL=L''URL JDBC ne peut \u00EAtre vide.
I18nMessage.errorCantLoadDriver=Impossible de charger le pilote JDBC pour\u00A0: {0}
I18nMessage.errorUnsupportedSubProtocol=Sous-protocole non support\u00E9 pour le type de base de donn\u00E9es s\u00E9lectionn\u00E9
I18nMessage.errorInvalidConnection=Connexion invalide
I18nMessage.errorDriverNotFound=Pilote introuvable pour le type de base de donn\u00E9es {0}.
I18nMessage.errorSQL=Erreur SQL [{0}] {1}
I18nMessage.errorDriverInstantiation=\u00C9chec de la connexion\u00A0: impossible d''instancier le pilote. {0}
I18nMessage.errorUnauthorizedQuery=Requ\u00EAte invalide, seules certaines requ\u00EAtes sont autoris\u00E9es.
I18nMessage.errorEmptyQuery=La requ\u00EAte SQL ne peut \u00EAtre nulle ou vide.
I18nMessage.errorNoKeyForDeleteQuery=D\u00E9finissez au moins une colonne comme cl\u00E9 pour l''action de suppression.
I18nMessage.errorNoKeyForUpdateQuery=D\u00E9finissez au moins une colonne comme cl\u00E9 pour l''action de mise \u00E0 jour.
I18nMessage.errorNoFieldForQueryParam=Champ {0} introuvable dans l''enregistrement entrant. Ce champ fait partie des param\u00E8tres de requ\u00EAte.
I18nMessage.errorNoUpdatableColumnWasDefined=D\u00E9finissez au moins une colonne \u00E0 mettre \u00E0 jour.
I18nMessage.errorUnsupportedDatabaseAction=Action sur la base de donn\u00E9es non support\u00E9e
I18nMessage.errorCantClearPreparedStatement=Impossible d''effacer les param\u00E8tres d''instruction pr\u00E9par\u00E9e.
I18nMessage.errorCantClosePreparedStatement=Impossible de fermer correctement l''instruction pr\u00E9par\u00E9e.
I18nMessage.errorCantCloseJdbcConnectionProperly=Impossible de fermer correctement la connexion JDBC.
I18nMessage.errorCantLoadTableSuggestions=Impossible de charger le nom des tables depuis la base de donn\u00E9es.
I18nMessage.errorTaberDoesNotExists=La table {0} n''existe pas. Cr\u00E9ez manuellement la table ou utilisez l''option Cr\u00E9er la table si elle n''existe pas.
I18nMessage.errorRedshiftUnsupportedBytes=Type de champ {0} non support\u00E9. Les octets ne sont pas support\u00E9s par Redshift. Les utilisateurs AWS peuvent utiliser S3 pour stocker leurs donn\u00E9es binaires.
I18nMessage.errorUnsupportedType=Type {0} non support\u00E9 pour le champ {1}
I18nMessage.errorUnsupportedBooleanType4Oracle=Le champ {0} est un bool\u00E9en. Oracle ne supporte pas directement le type Bool\u00E9en. Utilisez le processus TypeConverter afin de convertir le type.
I18nMessage.errorVacantAccountKey=Seule la connexion \u00E0 Azure Blob avec une cl\u00E9 partag\u00E9e est support\u00E9e. Renseignez le nom et la cl\u00E9 d''acc\u00E8s.
I18nMessage.errorSingleSortKeyInvalid=Seule une colonne peut \u00EAtre d\u00E9finie comme cl\u00E9 de tri seule dans Redshift.
I18nMessage.errorNoRecordReceived=Il doit y avoir au moins un enregistrement \u00E0 \u00E9crire en sortie.
I18nMessage.errorPrivateKeyPasswordIncorrect=Mot de passe incorrect pour la cl\u00E9 priv\u00E9e. R\u00E9essayez.
I18nMessage.errorPrivateKeyIncorrect=Cl\u00E9 priv\u00E9e fausse ou non support\u00E9e. R\u00E9essayez ou utilisez la cl\u00E9 g\u00E9n\u00E9r\u00E9e avec Snowflake.
I18nMessage.errorAccessTokenResponse=Impossible de r\u00E9cup\u00E9rer le jeton d''acc\u00E8s. Description de l''erreur\u00A0: {0}
#
# Warning
#
I18nMessage.warnResultSetCantBeClosed=Impossible de lib\u00E9rer le curseur de la requ\u00EAte.
I18nMessage.warnStatementCantBeClosed=Impossible de fermer l''instruction de la requ\u00EAte.
I18nMessage.warnConnectionCantBeClosed=Impossible de fermer correctement la connexion JDBC.
I18nMessage.warnReadOnlyOptimisationFailure=Impossible de passer cette connexion en lecture seule, cela n''est probablement pas support\u00E9 par votre base de donn\u00E9es.
I18nMessage.warnDriverClose=Impossible de fermer correctement le loader de la classe du pilote pour la base de donn\u00E9es {0}.
#
# Success
#
I18nMessage.successConnection=Connexion \u00E9tablie
# Action on data
I18nMessage.actionOnDataDelete=Supprimer
I18nMessage.actionOnDataInsert=Ins\u00E9rer
I18nMessage.actionOnDataUpdate=Mettre \u00E0 jour
I18nMessage.actionOnDataUpsert=Upsert
I18nMessage.actionOnDataBulkLoad=Charger en masse
#
I18nMessage.errorCantDiscoverDataset=Impossible de r\u00E9cup\u00E9rer la liste des tables\u00A0: {0}.
