#
# Error
#
I18nMessage.errorDriverDeregister=Registrierung des JDBC-Treibers {0} kann nicht aufgehoben werden.
I18nMessage.errorDriverLoad=Treiber nicht f\u00FCr Datenbanktyp {0} geladen. \nFolgende Treiberdateien wurden nicht gefunden: \n{1}
I18nMessage.errorEmptyJdbcURL=JDBC-URL darf nicht leer sein.
I18nMessage.errorCantLoadDriver=JDBC-Treiber kann nicht geladen werden f\u00FCr: {0}
I18nMessage.errorUnsupportedSubProtocol=Nicht unterst\u00FCtztes Unterprotokoll f\u00FCr ausgew\u00E4hlten Datenbanktyp
I18nMessage.errorInvalidConnection=Ung\u00FCltige Verbindung
I18nMessage.errorDriverNotFound=Treiber f\u00FCr Datenbanktyp {0} nicht gefunden.
I18nMessage.errorSQL=SQL-Fehler [{0}] {1}
I18nMessage.errorDriverInstantiation=Verbindung fehlgeschlagen. Treiber kann nicht instanziiert werden. {0}
I18nMessage.errorUnauthorizedQuery=Ung\u00FCltige Abfrage, nur spezifische Abfragen sind autorisiert.
I18nMessage.errorEmptyQuery=SQL-Abfrage darf nicht null oder leer sein.
I18nMessage.errorNoKeyForDeleteQuery=Definieren Sie mindestens eine Spalte als Schl\u00FCssel f\u00FCr die L\u00F6schaktion.
I18nMessage.errorNoKeyForUpdateQuery=Definieren Sie mindestens eine Spalte als Schl\u00FCssel f\u00FCr die Aktualisierungsaktion.
I18nMessage.errorNoFieldForQueryParam=Feld {0} im eingehenden Datensatz nicht gefunden. Dieses Feld ist Teil der Abfrageparameter.
I18nMessage.errorNoUpdatableColumnWasDefined=Definieren Sie mindestens eine zu aktualisierende Spalte.
I18nMessage.errorUnsupportedDatabaseAction=Nicht unterst\u00FCtzte Datenbankaktion
I18nMessage.errorCantClearPreparedStatement=Die vorbereiteten Statement-Parameter konnten nicht gel\u00F6scht werden.
I18nMessage.errorCantClosePreparedStatement=Das vorbereitete Statement kann nicht ordnungsgem\u00E4\u00DF geschlossen werden.
I18nMessage.errorCantCloseJdbcConnectionProperly=Die JDBC-Verbindung kann nicht ordnungsgem\u00E4\u00DF geschlossen werden.
I18nMessage.errorCantLoadTableSuggestions=Die Tabellennamen konnten nicht aus der Datenbank geladen werden.
I18nMessage.errorTaberDoesNotExists=Tabelle {0} existiert nicht. Erstellen Sie die Tabelle manuell oder verwenden Sie folgende Option: "Tabelle erstellen, wenn nicht vorhanden".
I18nMessage.errorRedshiftUnsupportedBytes=Nicht unterst\u00FCtzter Typ f\u00FCr Feld {0}. Bytes von Redshift nicht unterst\u00FCtzt. AWS-Benutzer k\u00F6nnen S3 zur Speicherung ihrer Bin\u00E4rdaten verwenden.
I18nMessage.errorUnsupportedType=Typ {0} f\u00FCr Feld {1} nicht unterst\u00FCtzt
I18nMessage.errorUnsupportedBooleanType4Oracle=Feld {0} ist boolesch und Oracle unterst\u00FCtzt den Boolesch-Typ nicht direkt. Verwenden Sie den TypeConverter-Prozess, um den Typ zu konvertieren.
I18nMessage.errorVacantAccountKey=Nur eine Azure Blob-Verbindung mit freigegebenem Schl\u00FCssel wird unterst\u00FCtzt. Geben Sie den Zugriffsnamen und Zugriffsschl\u00FCssel ein.
I18nMessage.errorSingleSortKeyInvalid=In Redshift kann nur eine Spalte als einzner Sortierschl\u00FCssel ausgew\u00E4hlt werden.
I18nMessage.errorNoRecordReceived=Es muss mindestens ein Datensatz f\u00FCr die Ausgabe vorhanden sein.
I18nMessage.errorPrivateKeyPasswordIncorrect=Falsches Passwort f\u00FCr privaten Schl\u00FCssel. Versuchen Sie es bitte erneut.
I18nMessage.errorPrivateKeyIncorrect=Falscher oder nicht unterst\u00FCtzter privater Schl\u00FCssel. Versuchen Sie es erneut oder verwenden Sie den mit Snowflake generierten Schl\u00FCssel.
I18nMessage.errorAccessTokenResponse=Zugriffstoken kann nicht abgerufen werden. Fehlerbeschreibung: {0}
#
# Warning
#
I18nMessage.warnResultSetCantBeClosed=Die Ergebnisgruppe der Abfrage konnte nicht geschlossen werden.
I18nMessage.warnStatementCantBeClosed=Das Abfrage-Statement konnte nicht geschlossen werden.
I18nMessage.warnConnectionCantBeClosed=Die JDBC-Verbindung konnte nicht ordnungsgem\u00E4\u00DF geschlossen werden.
I18nMessage.warnReadOnlyOptimisationFailure=Diese Verbindung kann nicht als Hinweis f\u00FCr den Treiber, die Datenbankoptimierung zu aktivieren, in den schreibgesch\u00FCtzten Modus gesetzt werden.
I18nMessage.warnDriverClose=Das Ladeprogramm f\u00FCr Treiberklassen f\u00FCr die Datenbank {0} kann nicht ordnungsgem\u00E4\u00DF geschlossen werden.
#
# Success
#
I18nMessage.successConnection=Verbindungsaufbau erfolgreich
# Action on data
I18nMessage.actionOnDataDelete=L\u00F6schen
I18nMessage.actionOnDataInsert=Einf\u00FCgen
I18nMessage.actionOnDataUpdate=Aktualisieren
I18nMessage.actionOnDataUpsert=Upsert
I18nMessage.actionOnDataBulkLoad=Bulk-Laden
#
I18nMessage.errorCantDiscoverDataset=Tabellenliste kann nicht abgerufen werden: {0}.
